NyankoLab/esp32c3-elf/module/symbols.cpp
#include "esp32c3.h"

extern "C" {

#include <sys/socket.h>
#include <sys/stat.h>
//#include <driver/i2c_master.h>
#include <driver/spi_slave.h>
//#include <esp_lcd_io_i2c.h>
//#include <esp_lcd_panel_ops.h>
//#include <esp_lcd_panel_ssd1306.h>
//#define CONFIG_ADC_SUPPRESS_DEPRECATE_WARN 1
//#include <esp_adc_cal.h>
#include <esp_adc/adc_oneshot.h>
#include <esp_ota_ops.h>
#include <esp_private/esp_clk.h>
#include <esp_private/periph_ctrl.h>
#include <soc/gpio_periph.h>
#include <soc/uart_periph.h>
#include <lwip/apps/sntp.h>
#include <hap.h>
#include <hap_apple_chars.h>
#include <hap_apple_servs.h>
#include <esp_hap_controllers.h>
#include <esp_hap_database.h>
#include "dlfcn.h"
#include "ethernet.h"
#include "httpd.h"
#include "https.h"
#include "lcd.h"
#include "mqtt.h"
#include "ota.h"
#include "temperature.h"
#include "wifi.h"
#include "elf_loader/include/private/elf_symbol.h"

#if HAVE_PREPATCH == 0

void* _Znaj(unsigned int s) { return malloc(s); }
void* _Znwj(unsigned int s) { return malloc(s); }
void _ZdaPv(void* p) { free(p); }
void _ZdlPv(void* p) { free(p); }
void _ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4findEcj();
void _ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4findEPKcj();
void _ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4findERKS5_j();
void _ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5emptyEv();
void _ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6substrEjj();
void _ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5clearEv();
void _ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__initEPKcj();
void _ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6appendEPKc();
void _ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6appendEPKcj();
void _ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6appendERKS5_();
void _ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6assignEPKc();
void _ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6resizeEj();
void _ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7replaceEjjPKc();
void _ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE9push_backEc();
void _ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEaSEOS5_();
void _ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEC2ILi0EEEPKc();
void _ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEED1Ev();
void _ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEED2Ev();

void _ZN4chip26CommissioningWindowManager28OpenBasicCommissioningWindowENSt3__16chrono8durationIjNS1_5ratioILx1ELx1EEEEENS_32CommissioningWindowAdvertisementE();
void _ZNK4chip26CommissioningWindowManager25IsCommissioningWindowOpenEv();
void _ZN4chip11DeviceLayer29SetDeviceInstanceInfoProviderEPNS0_26DeviceInstanceInfoProviderE();
void _ZN4chip6Server7sServerE();

void _ZN10esp_matter9attribute7get_valEtjjP21esp_matter_attr_val_t();
void _ZN10esp_matter9attribute6reportEtjjP21esp_matter_attr_val_t();
void _ZN10esp_matter9attribute6updateEtjjP21esp_matter_attr_val_t();
void _ZN10esp_matter7cluster3getEPjj();
void _ZN10esp_matter20default_app_event_cbEPKN4chip11DeviceLayer15ChipDeviceEventEi();
void _ZN10esp_matter29default_app_identification_cbENS_14identification13callback_typeEthhPv();
void _ZN10esp_matter8endpoint6get_idEPj();
void _ZN10esp_matter8endpoint13get_priv_dataEt();
void _ZN10esp_matter13factory_resetEv();
void _ZN10esp_matter16get_fabric_countEv();
void _ZN10esp_matter16get_pairing_codeERNSt3__112basic_stringIcNS0_11char_traitsIcEENS0_9allocatorIcEEEE();
void _ZN10esp_matter10is_startedEv();
void _ZN10esp_matter4node6createEPNS0_6configEPFiNS_9attribute13callback_typeEtjjP21esp_matter_attr_val_tPvEPFiNS_14identification13callback_typeEthhS7_ES7_();
void _ZN10esp_matter32set_commissionable_data_providerEv();
void _ZN10esp_matter33set_device_instance_info_providerEPKcS1_();
void _ZN10esp_matter11set_versionEPKc();
void _ZN10esp_matter5startEPFvPKN4chip11DeviceLayer15ChipDeviceEventEiEi();

void _ZN10esp_matter7cluster10thermostat9attribute18create_ac_capacityEPjt();
void _ZN10esp_matter7cluster10thermostat9attribute25create_ac_louver_positionEPjh();
void _ZN10esp_matter7cluster10thermostat9attribute26create_outdoor_temperatureEPj8nullableIsE();

// 1.0
void _ZN10esp_matter8endpoint12on_off_light3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint12on_off_light6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint14dimmable_light3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint14dimmable_light6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint23color_temperature_light3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint23color_temperature_light6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint20extended_color_light3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint20extended_color_light6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint19on_off_plug_in_unit3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint19on_off_plug_in_unit6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint21dimmable_plug_in_unit3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint21dimmable_plug_in_unit6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint10thermostat3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint10thermostat6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint15window_covering3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint15window_covering6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint18temperature_sensor3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint18temperature_sensor6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint15humidity_sensor3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint15humidity_sensor6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint16occupancy_sensor3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint16occupancy_sensor6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint14contact_sensor3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint14contact_sensor6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint12light_sensor3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint12light_sensor6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint9door_lock3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint9door_lock6createEPjPNS1_6configEhPv();

