NyankoLab/esp32c3-elf/module/symbols.cpp
// 1.2
void _ZN10esp_matter8endpoint12air_purifier3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint12air_purifier6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint3fan3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint3fan6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint14smoke_co_alarm3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint14smoke_co_alarm6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint22robotic_vacuum_cleaner3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint22robotic_vacuum_cleaner6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint11energy_evse3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint11energy_evse6createEPjPNS1_6configEhPv();

// 1.3
void _ZN10esp_matter8endpoint18air_quality_sensor3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint18air_quality_sensor6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint20room_air_conditioner3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint20room_air_conditioner6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint19water_leak_detector3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint19water_leak_detector6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint11water_valve3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint11water_valve6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint12water_heater3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint12water_heater6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint9heat_pump3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint9heat_pump6createEPjPNS1_6configEhPv();

// 1.4
void _ZN10esp_matter8endpoint5chime3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint5chime6createEPjPNS1_6configEhPv();
void _ZN10esp_matter8endpoint7closure3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint7closure6createEPjPNS1_6configEhPv();

// 1.5
void _ZN10esp_matter8endpoint6camera3addEPjPNS1_6configE();
void _ZN10esp_matter8endpoint6camera6createEPjPNS1_6configEhPv();

void init_udp_console(const char* ip);
BaseType_t xTaskCreatePinnedToCore(TaskFunction_t, const char* const, const configSTACK_DEPTH_TYPE, void* const, UBaseType_t, TaskHandle_t* const, const BaseType_t);
extern esp_app_desc_t esp_app_desc;

#undef ESP_ELFSYM_EXPORT
#define ESP_ELFSYM_EXPORT(_sym) { #_sym, (void*)&_sym }

extern const struct esp_elfsym g_customer_elfsyms[] = {

    // c
    ESP_ELFSYM_EXPORT(abort),
    ESP_ELFSYM_EXPORT(dlopen),
    ESP_ELFSYM_EXPORT(dlsym),
    ESP_ELFSYM_EXPORT(dlclose),
    ESP_ELFSYM_EXPORT(ftell),
    ESP_ELFSYM_EXPORT(fopen),
    ESP_ELFSYM_EXPORT(fclose),
    ESP_ELFSYM_EXPORT(fgetc),
    ESP_ELFSYM_EXPORT(fgets),
    ESP_ELFSYM_EXPORT(fread),
    ESP_ELFSYM_EXPORT(mkdir),
    ESP_ELFSYM_EXPORT(remove),
    ESP_ELFSYM_EXPORT(rename),
    ESP_ELFSYM_EXPORT(sprintf),
    ESP_ELFSYM_EXPORT(snprintf),
    ESP_ELFSYM_EXPORT(stat),
    ESP_ELFSYM_EXPORT(time),
    ESP_ELFSYM_EXPORT(localtime),
    ESP_ELFSYM_EXPORT(localtime_r),
    ESP_ELFSYM_EXPORT(setenv),
    ESP_ELFSYM_EXPORT(tzset),

    // c++
    ESP_ELFSYM_EXPORT(_Znaj),
    ESP_ELFSYM_EXPORT(_Znwj),
    ESP_ELFSYM_EXPORT(_ZdaPv),
    ESP_ELFSYM_EXPORT(_ZdlPv),
    ESP_ELFSYM_EXPORT(_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4findEcj),
    ESP_ELFSYM_EXPORT(_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4findEPKcj),
    ESP_ELFSYM_EXPORT(_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4findERKS5_j),
    ESP_ELFSYM_EXPORT(_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5emptyEv),
    ESP_ELFSYM_EXPORT(_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6substrEjj),
    ESP_ELFSYM_EXPORT(_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5clearEv),
    ESP_ELFSYM_EXPORT(_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__initEPKcj),
    ESP_ELFSYM_EXPORT(_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6appendEPKc),
    ESP_ELFSYM_EXPORT(_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6appendEPKcj),
    ESP_ELFSYM_EXPORT(_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6appendERKS5_),
    ESP_ELFSYM_EXPORT(_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6assignEPKc),
    ESP_ELFSYM_EXPORT(_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6resizeEj),
    ESP_ELFSYM_EXPORT(_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7replaceEjjPKc),
    ESP_ELFSYM_EXPORT(_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE9push_backEc),
    ESP_ELFSYM_EXPORT(_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEaSEOS5_),
    ESP_ELFSYM_EXPORT(_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEC2ILi0EEEPKc),
    ESP_ELFSYM_EXPORT(_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEED1Ev),
    ESP_ELFSYM_EXPORT(_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEED2Ev),

    // common
    ESP_ELFSYM_EXPORT(init_udp_console),
    ESP_ELFSYM_EXPORT(execv),
    ESP_ELFSYM_EXPORT(uart0_tx),
    ESP_ELFSYM_EXPORT(uart0_rx),
    ESP_ELFSYM_EXPORT(uart1_tx),
    ESP_ELFSYM_EXPORT(uart1_rx),
    ESP_ELFSYM_EXPORT(ap_netif),
    ESP_ELFSYM_EXPORT(eth_netif),
    ESP_ELFSYM_EXPORT(sta_netif),
    ESP_ELFSYM_EXPORT(httpd_server),

    // other
    ESP_ELFSYM_EXPORT(esp_app_desc),
    ESP_ELFSYM_EXPORT(esp_clk_apb_freq),
    ESP_ELFSYM_EXPORT(esp_get_idf_version),
    ESP_ELFSYM_EXPORT(esp_restart),
    ESP_ELFSYM_EXPORT(esp_timer_get_time),
    ESP_ELFSYM_EXPORT(g_wifi_default_wpa_crypto_funcs),
    ESP_ELFSYM_EXPORT(g_wifi_osi_funcs),
    ESP_ELFSYM_EXPORT(lwip_ioctl),
    ESP_ELFSYM_EXPORT(lwip_close),
    ESP_ELFSYM_EXPORT(periph_module_enable),
    ESP_ELFSYM_EXPORT(periph_module_reset),
    ESP_ELFSYM_EXPORT(uart_periph_signal),
    ESP_ELFSYM_EXPORT(GPIO_PIN_MUX_REG),
    ESP_ELFSYM_EXPORT(IP_EVENT),
    ESP_ELFSYM_EXPORT(WIFI_EVENT),

    // ethernet
    ESP_ELFSYM_EXPORT(ethernet),

    // httpd
    ESP_ELFSYM_EXPORT(httpd_start),
    ESP_ELFSYM_EXPORT(httpd_register_uri_handler),
    ESP_ELFSYM_EXPORT(httpd_unregister_uri_handler),
    ESP_ELFSYM_EXPORT(httpd_req_get_url_query_len),
    ESP_ELFSYM_EXPORT(httpd_req_get_url_query_str),
    ESP_ELFSYM_EXPORT(httpd_req_url_decode),
    ESP_ELFSYM_EXPORT(httpd_query_key_value),
    ESP_ELFSYM_EXPORT(httpd_query_decode_key_value),
    ESP_ELFSYM_EXPORT(httpd_resp_redirect),
    ESP_ELFSYM_EXPORT(httpd_resp_send),
    ESP_ELFSYM_EXPORT(httpd_resp_send_chunk),
    ESP_ELFSYM_EXPORT(httpd_resp_set_status),
    ESP_ELFSYM_EXPORT(httpd_resp_set_type),
    ESP_ELFSYM_EXPORT(httpd_resp_set_hdr),

    // https
    ESP_ELFSYM_EXPORT(https_connect),
    ESP_ELFSYM_EXPORT(https_disconnect),
    ESP_ELFSYM_EXPORT(https_send),
    ESP_ELFSYM_EXPORT(https_callback),

    // lcd
    ESP_ELFSYM_EXPORT(lcd_init),
    ESP_ELFSYM_EXPORT(lcd_text),

    // mqtt
    ESP_ELFSYM_EXPORT(mqtt_prefix),
    ESP_ELFSYM_EXPORT(mqtt_publish),
    ESP_ELFSYM_EXPORT(mqtt_receive),
    ESP_ELFSYM_EXPORT(mqtt_setup),
    ESP_ELFSYM_EXPORT(mqtt_connected),
    ESP_ELFSYM_EXPORT(mqtt_connected_internal),
    ESP_ELFSYM_EXPORT(mqtt_ready_internal),

    // ota
    ESP_ELFSYM_EXPORT(ota_init),

    // sntp
    ESP_ELFSYM_EXPORT(sntp_setoperatingmode),
    ESP_ELFSYM_EXPORT(sntp_getoperatingmode),
    ESP_ELFSYM_EXPORT(sntp_init),
    ESP_ELFSYM_EXPORT(sntp_stop),
    ESP_ELFSYM_EXPORT(sntp_enabled),
    ESP_ELFSYM_EXPORT(sntp_setserver),
    ESP_ELFSYM_EXPORT(sntp_getserver),
#if SNTP_MONITOR_SERVER_REACHABILITY
    ESP_ELFSYM_EXPORT(sntp_getreachability),
#endif
#if SNTP_SERVER_DNS
    ESP_ELFSYM_EXPORT(sntp_setservername),
    ESP_ELFSYM_EXPORT(sntp_getservername),
#endif
#if SNTP_GET_SERVERS_FROM_DHCP || SNTP_GET_SERVERS_FROM_DHCPV6
    ESP_ELFSYM_EXPORT(sntp_servermode_dhcp),
#endif

    // i2c
//  ESP_ELFSYM_EXPORT(i2c_new_master_bus),

    // spi_slave
    ESP_ELFSYM_EXPORT(spi_slave_initialize),
//  ESP_ELFSYM_EXPORT(spi_slave_free),
    ESP_ELFSYM_EXPORT(spi_slave_queue_trans),
    ESP_ELFSYM_EXPORT(spi_slave_get_trans_result),
    ESP_ELFSYM_EXPORT(spi_slave_transmit),

    // temperature
    ESP_ELFSYM_EXPORT(temperature_init),
    ESP_ELFSYM_EXPORT(temperature),

    // wifi
    ESP_ELFSYM_EXPORT(wifi_ap),
    ESP_ELFSYM_EXPORT(wifi_sta),

    // esp_adc
//  ESP_ELFSYM_EXPORT(esp_adc_cal_characterize),
//  ESP_ELFSYM_EXPORT(esp_adc_cal_raw_to_voltage),
//  ESP_ELFSYM_EXPORT(esp_adc_cal_get_voltage),
    ESP_ELFSYM_EXPORT(adc_oneshot_config_channel),
    ESP_ELFSYM_EXPORT(adc_oneshot_new_unit),
    ESP_ELFSYM_EXPORT(adc_oneshot_read),
    ESP_ELFSYM_EXPORT(adc_cali_create_scheme_curve_fitting),
    ESP_ELFSYM_EXPORT(adc_cali_raw_to_voltage),

