NyankoLab/esp32c3-elf/module/symbols.cpp
    // freertos
    ESP_ELFSYM_EXPORT(vTaskDelay),
    ESP_ELFSYM_EXPORT(vTaskDelete),
    ESP_ELFSYM_EXPORT(xTaskCreatePinnedToCore),
    ESP_ELFSYM_EXPORT(xTaskGetTickCount),
    ESP_ELFSYM_EXPORT(xTimerCreate),
    ESP_ELFSYM_EXPORT(xTimerGenericCommand),

#if HAVE_HOMEKIT
    // hap
//  ESP_ELFSYM_EXPORT(hap_set_debug_level),
    ESP_ELFSYM_EXPORT(hap_get_version),
    ESP_ELFSYM_EXPORT(hap_get_config),
    ESP_ELFSYM_EXPORT(hap_set_config),
//  ESP_ELFSYM_EXPORT(hap_update_config_number),
    ESP_ELFSYM_EXPORT(hap_init),
//  ESP_ELFSYM_EXPORT(hap_deinit),
    ESP_ELFSYM_EXPORT(hap_start),
//  ESP_ELFSYM_EXPORT(hap_stop),
    ESP_ELFSYM_EXPORT(hap_acc_create),
//  ESP_ELFSYM_EXPORT(hap_acc_add_accessory_flags),
//  ESP_ELFSYM_EXPORT(hap_acc_update_accessory_flags),
//  ESP_ELFSYM_EXPORT(hap_acc_add_product_data),
//  ESP_ELFSYM_EXPORT(hap_acc_add_wifi_transport_service),
    ESP_ELFSYM_EXPORT(hap_add_accessory),
//  ESP_ELFSYM_EXPORT(hap_add_bridged_accessory),
//  ESP_ELFSYM_EXPORT(hap_remove_bridged_accessory),
//  ESP_ELFSYM_EXPORT(hap_acc_delete),
//  ESP_ELFSYM_EXPORT(hap_delete_all_accessories),
//  ESP_ELFSYM_EXPORT(hap_get_unique_aid),
//  ESP_ELFSYM_EXPORT(hap_acc_get_by_aid),
//  ESP_ELFSYM_EXPORT(hap_get_first_acc),
//  ESP_ELFSYM_EXPORT(hap_acc_get_next),
//  ESP_ELFSYM_EXPORT(hap_acc_get_serv_by_iid),
//  ESP_ELFSYM_EXPORT(hap_acc_get_serv_by_uuid),
//  ESP_ELFSYM_EXPORT(hap_acc_get_char_by_iid),
//  ESP_ELFSYM_EXPORT(hap_acc_get_first_serv),
//  ESP_ELFSYM_EXPORT(hap_char_bool_create),
//  ESP_ELFSYM_EXPORT(hap_char_uint8_create),
//  ESP_ELFSYM_EXPORT(hap_char_uint16_create),
//  ESP_ELFSYM_EXPORT(hap_char_uint32_create),
//  ESP_ELFSYM_EXPORT(hap_char_uint64_create),
//  ESP_ELFSYM_EXPORT(hap_char_int_create),
//  ESP_ELFSYM_EXPORT(hap_char_float_create),
//  ESP_ELFSYM_EXPORT(hap_char_string_create),
//  ESP_ELFSYM_EXPORT(hap_char_data_create),
//  ESP_ELFSYM_EXPORT(hap_char_tlv8_create),
//  ESP_ELFSYM_EXPORT(hap_char_delete),
//  ESP_ELFSYM_EXPORT(hap_serv_create),
//  ESP_ELFSYM_EXPORT(hap_serv_delete),
//  ESP_ELFSYM_EXPORT(hap_acc_get_aid),
//  ESP_ELFSYM_EXPORT(hap_serv_get_char_by_uuid),
    ESP_ELFSYM_EXPORT(hap_serv_get_parent),
//  ESP_ELFSYM_EXPORT(hap_serv_get_next),
//  ESP_ELFSYM_EXPORT(hap_serv_get_first_char),
//  ESP_ELFSYM_EXPORT(hap_char_get_iid),
    ESP_ELFSYM_EXPORT(hap_char_get_type_uuid),
//  ESP_ELFSYM_EXPORT(hap_char_get_perm),
//  ESP_ELFSYM_EXPORT(hap_char_get_format),
//  ESP_ELFSYM_EXPORT(hap_serv_get_iid),
    ESP_ELFSYM_EXPORT(hap_serv_get_type_uuid),
    ESP_ELFSYM_EXPORT(hap_char_get_parent),
//  ESP_ELFSYM_EXPORT(hap_char_get_next),
//  ESP_ELFSYM_EXPORT(hap_char_int_set_constraints),
//  ESP_ELFSYM_EXPORT(hap_char_float_set_constraints),
//  ESP_ELFSYM_EXPORT(hap_char_string_set_maxlen),
//  ESP_ELFSYM_EXPORT(hap_char_add_description),
//  ESP_ELFSYM_EXPORT(hap_char_add_unit),
//  ESP_ELFSYM_EXPORT(hap_char_add_valid_vals),
//  ESP_ELFSYM_EXPORT(hap_char_add_valid_vals_range),
//  ESP_ELFSYM_EXPORT(hap_char_set_iid),
    ESP_ELFSYM_EXPORT(hap_serv_add_char),
    ESP_ELFSYM_EXPORT(hap_acc_add_serv),
    ESP_ELFSYM_EXPORT(hap_char_update_val),
//  ESP_ELFSYM_EXPORT(hap_char_get_val),
    ESP_ELFSYM_EXPORT(hap_serv_set_write_cb),
    ESP_ELFSYM_EXPORT(hap_serv_set_read_cb),
//  ESP_ELFSYM_EXPORT(hap_serv_set_bulk_read_cb),
//  ESP_ELFSYM_EXPORT(hap_serv_set_priv),
//  ESP_ELFSYM_EXPORT(hap_serv_get_priv),
//  ESP_ELFSYM_EXPORT(hap_serv_mark_primary),
//  ESP_ELFSYM_EXPORT(hap_serv_mark_hidden),
//  ESP_ELFSYM_EXPORT(hap_serv_link_serv),
//  ESP_ELFSYM_EXPORT(hap_serv_set_iid),
//  ESP_ELFSYM_EXPORT(hap_set_setup_info),
    ESP_ELFSYM_EXPORT(hap_set_setup_code),
    ESP_ELFSYM_EXPORT(hap_set_setup_id),
#if 0
    ESP_ELFSYM_EXPORT(hap_check_mfi_chip),
#endif
    ESP_ELFSYM_EXPORT(hap_reboot_accessory),
    ESP_ELFSYM_EXPORT(hap_reset_to_factory),
    ESP_ELFSYM_EXPORT(hap_reset_network),
    ESP_ELFSYM_EXPORT(hap_reset_homekit_data),
    ESP_ELFSYM_EXPORT(hap_reset_pairings),
//  ESP_ELFSYM_EXPORT(hap_is_req_admin),
    ESP_ELFSYM_EXPORT(hap_req_get_ctrl_id),
//  ESP_ELFSYM_EXPORT(hap_factory_keystore_get),
//  ESP_ELFSYM_EXPORT(hap_enable_mfi_auth),
//  ESP_ELFSYM_EXPORT(hap_register_event_handler),
    ESP_ELFSYM_EXPORT(hap_get_paired_controller_count),
//  ESP_ELFSYM_EXPORT(hap_http_debug_enable),
//  ESP_ELFSYM_EXPORT(hap_http_debug_disable),
//  ESP_ELFSYM_EXPORT(esp_hap_get_setup_payload),
//  ESP_ELFSYM_EXPORT(hap_pair_setup_re_enable),

    // hap_apple_chars
    ESP_ELFSYM_EXPORT(hap_char_brightness_create),
    ESP_ELFSYM_EXPORT(hap_char_cooling_threshold_temperature_create),
    ESP_ELFSYM_EXPORT(hap_char_current_door_state_create),
    ESP_ELFSYM_EXPORT(hap_char_current_heating_cooling_state_create),
    ESP_ELFSYM_EXPORT(hap_char_current_relative_humidity_create),
    ESP_ELFSYM_EXPORT(hap_char_current_temperature_create),
    ESP_ELFSYM_EXPORT(hap_char_firmware_revision_create),
    ESP_ELFSYM_EXPORT(hap_char_hardware_revision_create),
    ESP_ELFSYM_EXPORT(hap_char_heating_threshold_temperature_create),
    ESP_ELFSYM_EXPORT(hap_char_hue_create),
    ESP_ELFSYM_EXPORT(hap_char_identify_create),
    ESP_ELFSYM_EXPORT(hap_char_lock_current_state_create),
    ESP_ELFSYM_EXPORT(hap_char_lock_target_state_create),
    ESP_ELFSYM_EXPORT(hap_char_manufacturer_create),
    ESP_ELFSYM_EXPORT(hap_char_model_create),
    ESP_ELFSYM_EXPORT(hap_char_motion_detected_create),
    ESP_ELFSYM_EXPORT(hap_char_name_create),
    ESP_ELFSYM_EXPORT(hap_char_obstruction_detect_create),
    ESP_ELFSYM_EXPORT(hap_char_on_create),
    ESP_ELFSYM_EXPORT(hap_char_outlet_in_use_create),
    ESP_ELFSYM_EXPORT(hap_char_rotation_direction_create),
    ESP_ELFSYM_EXPORT(hap_char_rotation_speed_create),
    ESP_ELFSYM_EXPORT(hap_char_saturation_create),
    ESP_ELFSYM_EXPORT(hap_char_serial_number_create),
    ESP_ELFSYM_EXPORT(hap_char_target_door_state_create),
    ESP_ELFSYM_EXPORT(hap_char_target_heating_cooling_state_create),
    ESP_ELFSYM_EXPORT(hap_char_target_relative_humidity_create),
    ESP_ELFSYM_EXPORT(hap_char_target_temperature_create),
    ESP_ELFSYM_EXPORT(hap_char_temperature_display_units_create),
    ESP_ELFSYM_EXPORT(hap_char_version_create),
    ESP_ELFSYM_EXPORT(hap_char_security_system_current_state_create),
    ESP_ELFSYM_EXPORT(hap_char_security_system_target_state_create),
    ESP_ELFSYM_EXPORT(hap_char_battery_level_create),
    ESP_ELFSYM_EXPORT(hap_char_current_position_create),
    ESP_ELFSYM_EXPORT(hap_char_current_vertical_tilt_angle_create),
    ESP_ELFSYM_EXPORT(hap_char_hold_position_create),
    ESP_ELFSYM_EXPORT(hap_char_leak_detected_create),
    ESP_ELFSYM_EXPORT(hap_char_occupancy_detected_create),
    ESP_ELFSYM_EXPORT(hap_char_status_active_create),
    ESP_ELFSYM_EXPORT(hap_char_smoke_detected_create),
    ESP_ELFSYM_EXPORT(hap_char_status_fault_create),
    ESP_ELFSYM_EXPORT(hap_char_status_low_battery_create),
    ESP_ELFSYM_EXPORT(hap_char_status_tampered_create),
    ESP_ELFSYM_EXPORT(hap_char_target_horizontal_tilt_angle_create),
    ESP_ELFSYM_EXPORT(hap_char_target_position_create),
    ESP_ELFSYM_EXPORT(hap_char_target_vertical_tilt_angle_create),
    ESP_ELFSYM_EXPORT(hap_char_security_system_alarm_type_create),
    ESP_ELFSYM_EXPORT(hap_char_charging_state_create),
    ESP_ELFSYM_EXPORT(hap_char_carbon_monoxide_level_create),
    ESP_ELFSYM_EXPORT(hap_char_carbon_monoxide_peak_level_create),
    ESP_ELFSYM_EXPORT(hap_char_carbon_dioxide_detected_create),
    ESP_ELFSYM_EXPORT(hap_char_carbon_dioxide_level_create),
    ESP_ELFSYM_EXPORT(hap_char_carbon_dioxide_peak_level_create),
    ESP_ELFSYM_EXPORT(hap_char_carbon_monoxide_detected_create),
    ESP_ELFSYM_EXPORT(hap_char_contact_sensor_state_create),
    ESP_ELFSYM_EXPORT(hap_char_current_ambient_light_level_create),
    ESP_ELFSYM_EXPORT(hap_char_current_horizontal_tilt_angle_create),
    ESP_ELFSYM_EXPORT(hap_char_air_quality_create),
    ESP_ELFSYM_EXPORT(hap_char_accessory_flags_create),
    ESP_ELFSYM_EXPORT(hap_char_product_data_create),
    ESP_ELFSYM_EXPORT(hap_char_lock_physical_controls_create),
    ESP_ELFSYM_EXPORT(hap_char_current_air_purifier_state_create),
    ESP_ELFSYM_EXPORT(hap_char_current_slat_state_create),
    ESP_ELFSYM_EXPORT(hap_char_slat_type_create),
    ESP_ELFSYM_EXPORT(hap_char_filter_life_level_create),
    ESP_ELFSYM_EXPORT(hap_char_filter_change_indication_create),
    ESP_ELFSYM_EXPORT(hap_char_reset_filter_indication_create),
    ESP_ELFSYM_EXPORT(hap_char_target_air_purifier_state_create),
    ESP_ELFSYM_EXPORT(hap_char_target_fan_state_create),
    ESP_ELFSYM_EXPORT(hap_char_current_fan_state_create),
    ESP_ELFSYM_EXPORT(hap_char_position_state_create),
    ESP_ELFSYM_EXPORT(hap_char_programmable_switch_event_create),
    ESP_ELFSYM_EXPORT(hap_char_active_create),
    ESP_ELFSYM_EXPORT(hap_char_swing_mode_create),
    ESP_ELFSYM_EXPORT(hap_char_current_tilt_angle_create),
    ESP_ELFSYM_EXPORT(hap_char_target_tilt_angle_create),
    ESP_ELFSYM_EXPORT(hap_char_ozone_density_create),
    ESP_ELFSYM_EXPORT(hap_char_nitrogen_dioxide_density_create),
    ESP_ELFSYM_EXPORT(hap_char_sulphur_dioxide_density_create),
    ESP_ELFSYM_EXPORT(hap_char_pm_2_5_density_create),
    ESP_ELFSYM_EXPORT(hap_char_pm_10_density_create),
    ESP_ELFSYM_EXPORT(hap_char_voc_density_create),
    ESP_ELFSYM_EXPORT(hap_char_service_label_index_create),
    ESP_ELFSYM_EXPORT(hap_char_service_label_namespace_create),
    ESP_ELFSYM_EXPORT(hap_char_color_temperature_create),
    ESP_ELFSYM_EXPORT(hap_char_current_heater_cooler_state_create),
    ESP_ELFSYM_EXPORT(hap_char_target_heater_cooler_state_create),
    ESP_ELFSYM_EXPORT(hap_char_current_humidifier_dehumidifier_state_create),
    ESP_ELFSYM_EXPORT(hap_char_target_humidifier_dehumidifier_state_create),
    ESP_ELFSYM_EXPORT(hap_char_water_level_create),
    ESP_ELFSYM_EXPORT(hap_char_relative_humidity_dehumidifier_threshold_create),
    ESP_ELFSYM_EXPORT(hap_char_relative_humidity_humidifier_threshold_create),
    ESP_ELFSYM_EXPORT(hap_char_program_mode_create),
    ESP_ELFSYM_EXPORT(hap_char_in_use_create),
    ESP_ELFSYM_EXPORT(hap_char_set_duration_create),
    ESP_ELFSYM_EXPORT(hap_char_remaining_duration_create),
    ESP_ELFSYM_EXPORT(hap_char_valve_type_create),
    ESP_ELFSYM_EXPORT(hap_char_is_configured_create),
    ESP_ELFSYM_EXPORT(hap_char_status_jammed_create),
    ESP_ELFSYM_EXPORT(hap_char_administrator_only_access_create),
    ESP_ELFSYM_EXPORT(hap_char_lock_control_point_create),
    ESP_ELFSYM_EXPORT(hap_char_lock_last_known_action_create),
    ESP_ELFSYM_EXPORT(hap_char_lock_management_auto_security_timeout_create),
    ESP_ELFSYM_EXPORT(hap_char_logs_create),
    ESP_ELFSYM_EXPORT(hap_char_air_particulate_density_create),
    ESP_ELFSYM_EXPORT(hap_char_air_particulate_size_create),

    // hap_apple_servs
    ESP_ELFSYM_EXPORT(hap_serv_accessory_information_create),
    ESP_ELFSYM_EXPORT(hap_serv_protocol_information_create),
    ESP_ELFSYM_EXPORT(hap_serv_fan_create),
    ESP_ELFSYM_EXPORT(hap_serv_garage_door_opener_create),
    ESP_ELFSYM_EXPORT(hap_serv_lightbulb_create),
    ESP_ELFSYM_EXPORT(hap_serv_lock_management_create),
    ESP_ELFSYM_EXPORT(hap_serv_lock_mechanism_create),
    ESP_ELFSYM_EXPORT(hap_serv_outlet_create),
    ESP_ELFSYM_EXPORT(hap_serv_switch_create),
    ESP_ELFSYM_EXPORT(hap_serv_thermostat_create),
    ESP_ELFSYM_EXPORT(hap_serv_air_quality_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_security_system_create),
    ESP_ELFSYM_EXPORT(hap_serv_carbon_monoxide_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_contact_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_door_create),
    ESP_ELFSYM_EXPORT(hap_serv_humidity_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_leak_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_light_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_motion_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_occupancy_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_smoke_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_stateless_programmable_switch_create),
    ESP_ELFSYM_EXPORT(hap_serv_temperature_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_window_create),
    ESP_ELFSYM_EXPORT(hap_serv_window_covering_create),
    ESP_ELFSYM_EXPORT(hap_serv_battery_service_create),
    ESP_ELFSYM_EXPORT(hap_serv_carbon_dioxide_sensor_create),
    ESP_ELFSYM_EXPORT(hap_serv_fan_v2_create),
    ESP_ELFSYM_EXPORT(hap_serv_slat_create),
    ESP_ELFSYM_EXPORT(hap_serv_filter_maintenance_create),
    ESP_ELFSYM_EXPORT(hap_serv_air_purifier_create),
    ESP_ELFSYM_EXPORT(hap_serv_heater_cooler_create),
    ESP_ELFSYM_EXPORT(hap_serv_humidifier_dehumidifier_create),
    ESP_ELFSYM_EXPORT(hap_serv_service_label_create),
    ESP_ELFSYM_EXPORT(hap_serv_irrigation_system_create),
    ESP_ELFSYM_EXPORT(hap_serv_valve_create),
    ESP_ELFSYM_EXPORT(hap_serv_faucet_create),

    // hap_controllers
    ESP_ELFSYM_EXPORT(is_accessory_paired),
    ESP_ELFSYM_EXPORT(is_admin_paired),

    // hap_database
    ESP_ELFSYM_EXPORT(hap_get_acc_id),
#endif

#if HAVE_MATTER
    // chip
    ESP_ELFSYM_EXPORT(_ZN4chip26CommissioningWindowManager28OpenBasicCommissioningWindowENSt3__16chrono8durationIjNS1_5ratioILx1ELx1EEEEENS_32CommissioningWindowAdvertisementE),
    ESP_ELFSYM_EXPORT(_ZNK4chip26CommissioningWindowManager25IsCommissioningWindowOpenEv),
    ESP_ELFSYM_EXPORT(_ZN4chip11DeviceLayer29SetDeviceInstanceInfoProviderEPNS0_26DeviceInstanceInfoProviderE),
    ESP_ELFSYM_EXPORT(_ZN4chip6Server7sServerE),

